/**************************************************************************
文件版本：神炽焰 V1.0
文件功能：
1、低通滤波参数初始化
2、低通滤波计算函数
**************************************************************************/
#include "LowPassFilter.h"

/*-----------------------------------------------------------
函数功能: 低通滤波参数初始化
输入参数: 结构体参数，滤波系数
返 回 值: None
说    明: None
 -----------------------------------------------------------*/
void LPF_Struct_Init(LPF_Struct *LPF, float a)//低通滤波参数初始化
{
	LPF->a = a;//滤波系数 取值范围0~1
	LPF->OutValue=0;//滤波后的输出值
	LPF->SampleValue=0;//采样值 
}

/*-----------------------------------------------------------
函数功能: 低通滤波计算函数
输入参数: 结构体参数
返 回 值: None
说    明: None
 -----------------------------------------------------------*/
float LowPassFilter(LPF_Struct *LPF)
{   
	LPF->OutValue = LPF->a * LPF->SampleValue +  (1 - LPF->a) * LPF->OutValue ;   
	return LPF->OutValue;
} 
